lotr/app/controllers/characters_controller.rb

  def sort_by
   @characters = Character.all.order('name ASC')
---
SELECT "characters".* FROM "characters" ORDER BY name ASC

  def show
    @character = Character.find(params[:id])
---
SELECT "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

  def create
    @character = Character.new(character_params)
    if @character.valid?
      @character.save
---
INSERT INTO "characters" ("name", "location", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Samwise Gamche"], ["location", "The Shire"], ["created_at", "2020-11-04 21:16:23.380056"], ["updated_at", "2020-11-04 21:16:23.380056"]]