lotr/app/controllers/movies_controller.rb

  def create
  @movie = Movie.new(movie_params)
    if @movie.valid?
       @movie.save
---
INSERT INTO "movies" ("name", "release_year", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Hobbit 2"], ["release_year", 2014], ["description", "Sucky Movie"], ["created_at", "2020-11-03 19:53:16.680198"], ["updated_at", "2020-11-03 19:53:16.680198"]]

  def update
    movie = Movie.find(params[:id])
    movie.update(movie_params)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "movies" SET "release_year" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["release_year", 2003], ["updated_at", "2020-11-03 19:10:54.998498"], ["id", 7]]

  def destroy
   delete_movie = Movie.find(params[:id])
   delete_movie.delete
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 12]]