lotr/app/views/characters/_form.html.erb

<%=f.label :add_character_to_movie%>
<%=f.collection_check_boxes :movie_ids, Movie.all, :id, :name%>
---
SELECT "movies".* FROM "movies"