lotr/app/views/characters/show.html.erb


<%if @character.movies.any?%>
  <h2>Movies:</h2>
  <%@character.movies.each do |movie|%>
---
SELECT "movies".* FROM "movies" INNER JOIN "movie_characters" ON "movies"."id" = "movie_characters"."movie_id" WHERE "movie_characters"."character_id" = ?  [["character_id", 24]]
SELECT 1 AS one FROM "movies" INNER JOIN "movie_characters" ON "movies"."id" = "movie_characters"."movie_id" WHERE "movie_characters"."character_id" = ? LIMIT ?  [["character_id", 28], ["LIMIT", 1]]
SELECT "movies".* FROM "movies" INNER JOIN "movie_characters" ON "movies"."id" = "movie_characters"."movie_id" WHERE "movie_characters"."character_id" = ?  [["character_id", 28]]