lotr/app/views/movies/_form.html.erb

SELECT "characters".* FROM "characters"
---
<%=f.label :add_character%>
<%=f.collection_check_boxes :character_ids, Character.all, :id, :name%>