lotr/app/views/movies/show.html.erb

SELECT "characters".* FROM "characters" INNER JOIN "movie_characters" ON "characters"."id" = "movie_characters"."character_id" WHERE "movie_characters"."movie_id" = ?  [["movie_id", 7]]
---
<h4>Characters:</h4>
<%@movie.characters.each do |character|%>